import React from 'react'
import img1 from './1.jpg'
import img2 from './2.jpg'
import img3 from './3.png'
import img4 from './4.JPG'

export default class CARE extends React.Component {

		render(){

			const whiteBg = {
				backgroundColor: 'white',
				marginBottom: '0px'
			}

			return (
				<div className="jumbotron jumbotron-fluid" style={whiteBg} id="lab-care">
					<div className="container">
						<div className="row">
							<div className="col">
								<h1>Cybernetics and Reality Engineering (CARE)</h1>
							</div>
						</div>
						<div className="row">
							<div className="col">
								<p>
									สำหรับเรา ได้ไปอยู่ที่แลป Cybernetics and Reality Engineering (CARE lab)
								</p>
							</div>
						</div>
						<div className="row">
							<div className="col">
								<img src={img3} className="img-fluid" />
							</div>
						</div>
						<div className="row">
							<div className="col">
								<p>
									ซึ่งบางคนก็จะงงกันว่าเอ๊ะ มีแลปนี้อยู่ด้วยหรอ ที่ดูปีที่แล้วไม่มีนี่หว่า…
								</p>
							</div>
						</div>
						<div className="row">
							<div className="col">
								<p>
									แหม ก็ใช่สิ นี่แลปใหม่นี่หว่า 55555555 แลปนี้เดิมคือ Vision and Media Computing ซึ่งเป็นของอ. Yokoya แต่ตอนนี้ท่านเกษียณไปแล้ว (เกษียณขึ้นไปเป็น President ;) ) แลปก็เลยตกมาอยู่ในมือของอ.ที่เพิ่งย้ายมาจาก Osaka U. นั่นก็คืออ. Kiyokawa ซึ่งเป็นคนดูแลเราเอง
								</p>
							</div>
						</div>
						<div className="row">
							<div className="col">
								<p>
									แลปนี้ทำเกี่ยวกับพวก Computer Vision, Mixed Reality, HCI, Image Processing ประมาณนี้ รายละเอียดว่ามีอาจารย์เป็นใครบ้าง มีโปรเจคอะไรยังไง ขอเชิญเว็ปด้านล่างเลยค่ะ // ผายมือชี้เหมือนแอร์การบินไทย
								</p>
							</div>
						</div>
						<div className="row">
							<div className="col">
								<p>
									https://carelab.info
								</p>
							</div>
						</div>
						<div className="row">
							<div className="col">
								<p>
									โปรเจคที่เราได้เป็นโปรเจคทำทัวร์แลป โดยใช้ Microsoft Hololens บาคนอาจจะงงว่าเอ้าซ้ำกะโอ้ตหรอ? ไม่จร้า ของโอ๊ตล้ำกว่าเยอะ 555555 โดยเราจะใช้ 3D Model ที่ทำมาจากการ 3D Reconstruction มาใส่ในโปรแกรม (จริงๆมันก็คือ app นั่นแหละ) มาจำลองเป็นโฮโลแกรมสามมิติล้ำๆไปเลย แล้วก็พอเวลาหันไปที่โต๊ะทำงานใคร ก็จะโผล่ป้ายบอกข้อมูลของคนนั้นมา นอกจากนี้ยังมี Minimap + Navigator แล้วก็ระบบสั่งการด้วยเสียงหาคนที่เราต้องการหา แล้วจะโผล่ลำแสงพาไปหาคนๆนั้นในโลกเสมือนใน app นั้นอีกด้วย น่อว์ว์ว์ว์ว์ว์ว์ว์ว์ว์ว์
								</p>
							</div>
						</div>
						<div className="row">
							<div className="col">
								<p>
									อีกอย่างนึงคือแลปนี้จะมีการประชุมแลปทุกสัปดาห์ ซึ่งทุกคนก็จะต้องมารายงานความคืบหน้าของงานตัวเองทุกอาทิตย์ พร้อมทำสไลด์นำเสนอด้วย ซึ่งตรงนี้แหละที่ฝึกภาษาอังกฤษกับความมั่นใจของเรา และทำให้เราแอคทีฟอีกด้วย เนื่องจากเป็นการกดดันตัวเองว่าถ้าเราไม่ทำแล้วเราจะเอาอะไรไปโชว์อาทิตย์หน้า 55555
								</p>
							</div>
						</div>
						<div className="row">
							<div className="col">
								<p>
									บายเดอะเวย์ เราจะไม่พูดสาระเยอะมากในจุดๆนี้ 5555555 ในแลปเรามีรุ่นพี่คนไทยสองคน นับได้ว่าเป็นบุญเหลือล้นคณานับ แล้วก็จะมีคนมาถามว่าอ่าวแล้วรุ่นพี่คนอื่นที่เป็นคนญี่ปุ่นหละ ไม่ได้ทำความรู้จักไว้เลยหรอ คำตอบคือ เราพยายามอย่างถึงที่สุดแล้ว 555555 คนที่นั่งข้างเรา อุตส่าห์ทักเรามากู้ดอาฟเตอร์นูน เราก็พ่นๆๆๆ eng ใส่เบาๆ เขาก็ทำหน้างงๆ แล้วก็ทำมือทำท่าขอเวลาแปป แล้วเขาก็หันไปเข้า google translate ในคอม แล้วหันจอมาให้เราอ่าน … สรุปแล้วคนที่พูด eng ได้รู้เรื่องที่สุดไม่ใช่ใครที่ไหนใกล ก็ Prof หัวหน้าแลปที่ดูแลเรานั่นแหละ 555555
								</p>
							</div>
						</div>
						<div className="row">
							<div className="col">
								<p>
									แต่ทุกคนดูเป็นมิตร (นึกถึงช่วงนึงของรายการหิ้วหวีไปหิ้วหวีมา 555555 "เรามาอย่าง… เป็นมิตรรร!!!") พี่ป.เอกนางเป็นคน Kumamoto กลับบ้านไปทีก็จะหอบผลไม้กลับมาที่แลป เพราะบ้านนางทำสวนผลไม้ พี่คนไทยเล่าให้ฟังว่าครั้งนึงนางขนมะเขือเทศมาจร้า แต่ไม่ค่อยมีใครกิน นางเลยเฟลไปพักใหญ่ คราวที่เราไปนางขนเมล่อนมาจร้า อร่อยอยู่ แต่ด้วยมารยาทไทยที่ถูกสั่งสอนกันมา กว่าเราจะกล้าไปกินด้วยก็ปาไปเดือนสุดท้ายแล้ว 5555 ส่วนพี่ป.โทปีแรก มีอยู่ด้วยกัน 4 คน และทุกคนล้วนใส่แว่น พี่สี่คนนั้นก็เฟรนลี่ดี ส่วนที่เหลือก็เป็นพี่ปีสอง มีสองคนที่เป็นคนญี่ปุ่น ทั้งสองคนดูเงียบๆ เลยยิ่งไม่กล้าเข้าไปทักใหญ่ ก็จะมีพี่คนไทยปีสองอีกสองคนนี่แหละ ที่เป็นสะพานเชื่อมให้เราได้คุยกับคนในแลปที่เหลือ 55555555
								</p>
							</div>
						</div>
						<div className="row">
							<div className="col">
								<p>
									ตอนเราไปถึง ห้องรกมาก เพราะซากอารยธรรมจากแลปเก่า ซึ่ง Prof ใหม่เขาจะโลกทิ้ง แล้วซื้อ Furniture ใหม่หมด พี่คนไทยบอกว่า เขาบอกว่าจะเปลี่ยนแลปใหม่ให้เป็นแบบ Google (ว้าว!) ซึ่งนั่นทำให้งานเราที่ต้องทำ 3D Reconstruction ห้องแลป กลายเป็นอาทิตย์เกือบสุดท้ายก่อนกลับไทย 555555 (ร้อนนนนน) ซึ่งพอแต่เสร็จแล้วก็ถือว่าโอเค มีทั้งไวท์บอร์ดแบบแผ่นแม่เหล็กติดกับผนัง หุ่นยนต์ทำความสะอาดห้อง ลูกบอลดึ๋งๆไว้นั่ง พรหมแสนนุ่ม และอื่นๆอีกมากมาย ที่ทำให้บรรยากาศน่าทำงานมว๊ากกกก ซึ่งตอนเรากลับเขาก็บอกว่านี่ยังสั่งมาไม่หมด ยังมีอีก 5555
								</p>
							</div>
						</div>
						<div className="row">
							<div className="col">
								<img src={img1} className="img-fluid" />
							</div>
						</div>
						<div className="row">
							<div className="col">
								<p>
									และนี่คือสภาพห้องที่รื้อไปบางส่วนแล้ว (ใช่ ยังรื้อไม่หมด)
								</p>
							</div>
						</div>
						<div className="row">
							<div className="col">
								<p>
									สุดท้ายนี้ก็อยากจะบอกว่า แฮปปี้กับแลปนี้ ทุกคนดูเป็นมิตร บรรยากาศดูชิวๆ พร้อมๆไปกับงานที่เดินด้วย (หมายถึงงานเดินจริงๆนะ อาจเป็นเพราะประชุมแลปมั้ง 5555)  ขอบคุณ Prof ที่ให้โอกาศเด็กคนนึงเล่นของเล่นราคาเป็นแสน และดูแลผมเป็นอย่างดี ขอบคุณอ. Kawai ที่ดูแลเรื่อง Account แลปและช่วย set server ให้ ขอบคุณพี่คนไทยสองคนที่ช่วยผมสื่อสารกับคนในแลปด้วย โดยเฉพาะพี่ทิกะพี่ป.เอก Takehara ที่ช่วยผมทำ 3D Reconstruction ขอบคุณคุณเลขา Nakamura ที่พาผมไปห้องพยาบาลตอนโดนขอบซีเมนต์บาด และที่สำคัญ ขอบคุณทุกคนเลยที่ให้ประสบการณ์ดีๆในชีวิตเด็กบ้าๆคนนึงอย่างผม ありがとうございました.
								</p>
							</div>
						</div>
						<div className="row">
							<div className="col">
								<img src={img4} className="img-fluid" />
							</div>
						</div>
						<div className="row">
							<div className="col">
								<p>
									<small>
										รายนามผู้มีอุปการคุณจากซ้ายไปขวา : Take san, พี่ทิ, OKD san, Watanabe san (Neko Callcenter / พอดีวันถ่ายเขาไม่มา), Terada san, Koga san, Prof. Kiyokawa
									</small>
								</p>
							</div>
						</div>
						<div className="row">
							<div className="col">
								<p>
									<small>
										ป.ล.1 Prof บอกถ้าปีหน้าคุณมาใหม่ แลปจะอลังกว่านี้พร้อมมีฝรั่งมา speak English เพิ่มแน่นอน 555555
									</small>
								</p>
							</div>
						</div>
						<div className="row">
							<div className="col">
								<p>
									<small>
										ป.ล.2 รูปเราขึ้นหน้าเว็ปแลปซะหราเลย หากันเอาเองละกัน คนรู้กันหมดเลยเนี่ย ว่าเราเปนน้องเ_ยน (ลูกเพจ น้องง)
									</small>
								</p>
							</div>
						</div>
						<div className="row">
							<div className="col">
								<img src={img2} className="img-fluid" />
							</div>
						</div>
					</div>
				</div>
			)
		}

}
